STATS = '''
📊 Статистика:

· Всего - <code>%s</code>
· Живы - <code>%s</code>
· Мертвы - <code>%s</code>
· Подписались на ОП - <code>%s</code>
· Чаты - <code>%s</code>
· Диалоги - <code>%s</code>

👤 Статистика по времени:

· За сегодня - <code>%s</code>
· За неделю - <code>%s</code>
· За месяц - <code>%s</code>

📈 Статистика самороста:

· За сегодня - <code>%s</code>
· За неделю - <code>%s</code>
· За месяц - <code>%s</code>
'''
MONEY = '''
📊 Статистика:

· За сегодня - <code>%s</code>
· За неделю - <code>%s</code>
· За месяц - <code>%s</code>
'''

REF = '''
Название ссылки: <code>%s</code>

📊 Статистика:

· Всего перешли - <code>%i</code>
· Из них уникальны - <code>%i</code>
· Из них живы - <code>%i</code>
· Подписались на ОП - <code>%i</code>

👤 Статистика по времени:

· Сегодня - <code>%i</code>
· За последние 7 дней - <code>%i</code>
· За последние 31 день - <code>%i</code>

💰 Цены:

· Цена ссылки - <code>%i</code>
· Цена за переход - <code>%s</code>
· Цена за уникального - <code>%s</code>
· Цена за подписчика (ОП) - <code>%s</code>

Ссылка: <code>https://t.me/%s?start=%s</code>
'''
REF_LIST = 'Список реф. ссылок.'
REF_DEL = 'Вы уверены, что хотите удалить реф. ссылку <code>%s</code>?'
REF_ADD = '''
Введите данные в формате:
<code>
  Название ссылки (например, bifle)
  Цена ссылки
</code>
'''

PRE_CHANNEL_ADD = 'Что добавляем?'
CHANNEL_ADD = '''
Введите данные в формате:
<code>
  Токен бота | ID канала*
  Название кнопки
  Ссылка на бота | канал
  Отслеживать подписки (1 - да, 0 - нет)
  Лимит переходов (0 - без лимита)
</code>
*ID можно получить через @username_to_id_bot
'''

SPONSOR_DEL = 'Вы уверены, что хотите удалить спонсора <code>%s</code>?'
SPONSORS = '''
Список спонсоров

🟢 - активен
⭕ - отключен

🤖 - бот
💬 - канал
'''

ADS_ADD = '''
Введите данные в формате:
<code>
  Название поста
  Кол-во просмотров (0 - без лимита)
</code>
'''


ROOM_ADD = '''
Введите данные в формате:
<code>
  Название комнаты*
  Макс. кол-во участников (0 - без лимита)
</code>
'''

ROOM_INFO = '''🏠 Комната
Название комнаты: <code>%s</code>
Участников: <code>%s/%s</code>


'''