START = '''
🏠 Главное меню:
'''

REG_GENDER = '''
<b>📝 Регистрация</>
👣 Шаг 1 из 2

<i>Выбери ниже, какого ты пола?</>
'''
REG_AGE = '''
<b>📝 Регистрация</>
👣 Шаг 2 из 2

<i>Напиши, cколько тебе лет? (от 10 до 99)</>
'''

NOT_SUBBED = '''
<i><b>✅Чтобы пользоваться ботом, вы должны подписаться на наши каналы</b>

Подпишиcь и нажми «Продолжить»!</i>
'''

DEFAULT_VIP = 'Данный функционал доступен только для VIP пользователей'

VIP = '''
<b>Преимущества VIP 👑:</>

<i>🔎 - Поиск по полу
🔞 - Пошлый чат
🏠 - Комнаты
❌ - Отключение рекламы
🖼 - Обмен медиа (фото, видео, гифки, стикеры)</>
'''
BUY_VIP_BALANCE = '''<b>Подписка VIP 👑
🗓 Дней - </b> %s

Стоимость: %s ₽
Ваш баланс: %s ₽
'''


TOP_UP_BALANCE = '''
💰 Пополнение баланса на сумму: %s ₽

• <i>После оплаты нажмите на кнопку "Проверить"</i> ✅
'''

BILL = '''
⭐️ Чтобы получить доступ к VIP - подписке, оплатите счёт ниже ⬇️ 

• <i>После оплаты нажмите на кнопку "Проверить"</i> ✅
'''
REF = '''
<i>Приглашайте пользователей по своей ссылке и получайте</> <b>👑 VIP статус</> <i>на 1 день за каждого пятого друга!</>

<b>Приглашено:</> <code>%i</>

Ваша персональная ссылка:
👉  https://t.me/%s?start=%i
'''

PROFILE = '''
<b>👤 Профиль</>

<b>💬 Имя -</b> %s
<b>👫 Пол -</b> %s
<b>🔞 Возраст -</b> %s
<b>👑 VIP -</b> %s
<b>💰 Баланс -</b> %i ₽
'''

SEARCH_END = '''
<b>💬 Поиск прекращен</>

<i>Для работы с ботом используйте кнопки снизу, также можно использовать меню команд.</>
'''

DIALOGUE_END = '''
<b>💬 Диалог прекращен</>

<i>Для работы с ботом используйте кнопки снизу, также можно использовать меню команд.</>
'''
DIALOGUE_SEARCH = '''
<b>🔎 Поиск собеседника...</>

<i>/stop - остановить поиск ❌</>
'''
DIALOGUE_GENDER = '<i>Выберите пол собеседника! ❤️‍🔥</>'
DIALOGUE_FOUND = '''
<b>Собеседник найден! 🎁</>

<i>Для поиска след. собеседника - /next
Для прекращения диалога - /stop</>
'''
DIALOGUE_FRIEND = '''
<b>Диалог с другом создан! 👥 </>

<i>Для прекращения диалога - /stop</>
'''
BANNED = '<b>⛔️ Ваш аккаунт заблокирован.</>'
PRE_SHOW_CONTACTS = '''
<b>📱 Показать контакты</>

Стоимость услуги: %i ₽
Ваш Баланс: %i ₽
'''
SHOW_CONTACTS = '''
💬 Имя: %s
💬 Фамилия: %s
🔗 %s: %s

'''
ADD_FRIEND_REQUEST = '''
<b>📩 Запрос в друзья отправлен!</>
'''

ADD_FRIEND_REQUEST_SECOND = '''
<b>👥 Ваш собеседник хочет добавить вас в друзья</>
'''
MY_FRIENDS = '''
<b>👥 Мои друзья - %s</>

🟢 - Доступен
🔴 - Не доступен (заблокировал бота)
🟡 - В диалоге
'''

FRIEND_INFO = ''' 
👥 Мой друг [%s]:

<b>💬 Имя -</b> %s
<b>👫 Пол -</b> %s
<b>🔞 Возраст -</b> %s
<b>👑 VIP -</b> %s
'''
FRIEND_DIALOGUE_REQUEST = '''
👥 Ваш друг %s хочет вас пригласить в диалог!
'''




PRE_COMPLAINT = '''
<b>❗️ Напишите причину жалобы на собеседника</>
<i>Следующее сообщение не будет отправлено собеседнику</>
'''


VIEW_COMPLAINT = '''
<b>❗️ Жалоба на собеседника</>
Причина: <i>%s</>
'''


COMPLAINT = '''
<b>❗️ Жалоба на пользователя</>

<b>ID Диалога:</b> %s
<b>Потерпевший:</b> %s
<b>Обвиняемый:</b> %s

<b>Причина:</b> <i>%s</>
'''

JOIN_ROOM = '''
<b>🏠 Вход в комнату [%s]</>
<b>👤 Никнейм:</b> %s
<b>👤 Участников:</b> %s

<i>/leave - покинуть комнату 🚪</>
<i>/members - посмотреть участников 👤</>
'''

PRE_ROOM_CHANGE_NICKNAME = '''
<b>🏠 Комната:</b> %s

<b>👤 Ваш Никнейм:</b> %s

Стоимость услуги: %i ₽
Ваш Баланс: %i ₽
'''
ROOM_CHANGE_NICKNAME = '''
<b>🏠 Комната:</b> %s

<b>👤 Ваш Никнейм:</b> %s
<b>👤 Новый Никнейм:</b> %s

Стоимость услуги: %i ₽
Ваш Баланс: %i ₽
'''


